martin8947/mcux_stage/mcxw_stage/drivers/fsl_spc.h
/*******************************************************************************
 * API
 ******************************************************************************/
#if defined(__cplusplus)
extern "C" {
#endif /* __cplusplus */

/*!
 * @name SPC Status
 * @{
 */
/*!
 * @brief Gets Isolation status for each power domains.
 *
 * This function gets the status which indicates whether certain
 * peripheral and the IO pads are in a latched state as a result
 * of having been in POWERDOWN mode.
 *
 * @param base SPC peripheral base address.
 * @return Current isolation status for each power domains. See @ref _spc_power_domains for details.
 */
uint8_t SPC_GetPeriphIOIsolationStatus(SPC_Type *base);

/*!
 * @brief Clears peripherals and I/O pads isolation flags for each power domains.
 *
 * This function clears peripherals and I/O pads isolation flags for each power domains.
 * After recovering from the POWERDOWN mode, user must invoke this function to release the
 * I/O pads and certain peripherals to their normal run mode state. Before invoking this
 * function, user must restore chip configuration in particular pin configuration for enabled
 * WUU wakeup pins.
 *
 * @param base SPC peripheral base address.
 */
static inline void SPC_ClearPeriphIOIsolationFlag(SPC_Type *base)
{
    base->SC |= SPC_SC_ISO_CLR_MASK;
}

/*!
 * @brief Gets SPC busy status flag.
 *
 * This function gets SPC busy status flag. When SPC executing any type of power mode
 * transition in ACTIVE mode or any of the SOC low power mode, the SPC busy status flag is set
 * and this function returns true. When changing CORE LDO voltage level and DCDC voltage level
 * in ACTIVE mode, the SPC busy status flag is set and this function return true.
 *
 * @param base SPC peripheral base address.
 * @return Ack busy flag.
 *          true    -   SPC is busy.
 *          false   -   SPC is not busy.
 */
static inline bool SPC_GetBusyStatusFlag(SPC_Type *base)
{
#if (defined(FSL_FEATURE_SPC_HAS_SC_REG_BUSY ) && FSL_FEATURE_SPC_HAS_SC_REG_BUSY)
    return ((base->SC & SPC_SC_REG_BUSY_MASK) != 0UL);
#else
    return ((base->SC & SPC_SC_BUSY_MASK) != 0UL);
#endif
}

#if !(defined(FSL_FEATURE_SPC_HAS_SC_SPC_LP_REQ_BIT) && (FSL_FEATURE_SPC_HAS_SC_SPC_LP_REQ_BIT==0U))
/*!
 * @brief Checks system low power request.
 *
 * @note Only when all power domains request low power mode entry, the result of this function is true. That means when
 * all power domains request low power mode entry, the SPC regulators will be controlled by LP_CFG register.
 *
 * @param base SPC peripheral base address.
 * @return The system low power request check result.
 *       - \b true All power domains have requested low power mode and SPC has entered a low power state and power mode
 *                 configuration are based on the LP_CFG configuration register.
 *       - \b false SPC in active mode and ACTIVE_CFG register control system power supply.
 */
static inline bool SPC_CheckLowPowerReqest(SPC_Type *base)
{
    return ((base->SC & SPC_SC_SPC_LP_REQ_MASK) == SPC_SC_SPC_LP_REQ_MASK);
}

/*!
 * @brief Clears system low power request, set SPC in active mode.
 *
 * @param base SPC peripheral base address.
 */
static inline void SPC_ClearLowPowerRequest(SPC_Type *base)
{
    base->SC |= SPC_SC_SPC_LP_REQ_MASK;
}
#endif /* FSL_FEATURE_SPC_HAS_SC_SPC_LP_REQ_BIT */

/*!
 * @brief Checks power switch state.
 *
 * @param base SPC peripheral base address.
 * @return The state(ON/OFF) of power switch.
 *          - \b true Indicates the power switch is ON.
 *          - \b false Indicates the power switch is OFF.
 */
static inline bool SPC_CheckPowerSwitchState(SPC_Type *base)
{
    return ((base->SC & SPC_SC_SWITCH_STATE_MASK) == SPC_SC_SWITCH_STATE_MASK);
}

/*!
 * @brief Gets selected power domain's requested low power mode.
 *
 * @param base SPC peripheral base address.
 * @param powerDomainId Power Domain Id, please refer to @ref spc_power_domain_id_t.
 *
 * @return The selected power domain's requested low power mode, please refer to @ref spc_power_domain_low_power_mode_t.
 */
spc_power_domain_low_power_mode_t SPC_GetPowerDomainLowPowerMode(SPC_Type *base, spc_power_domain_id_t powerDomainId);

/*!
 * @brief Checks power domain's low power request.
 *
 * @param base SPC peripheral base address.
 * @param powerDomainId Power Domain Id, please refer to @ref spc_power_domain_id_t.
 * @return The result of power domain's low power request.
 *            - \b true The selected power domain requests low power mode entry.
 *            - \b false The selected power domain does not request low power mode entry.
 */
static inline bool SPC_CheckPowerDomainLowPowerRequest(SPC_Type *base, spc_power_domain_id_t powerDomainId)
{
    return ((base->PD_STATUS[(uint8_t)powerDomainId] & SPC_PD_STATUS_PD_LP_REQ_MASK) == SPC_PD_STATUS_PD_LP_REQ_MASK);
}

/*!
 * @brief Clears selected power domain's low power request flag.
 *
 * @param base SPC peripheral base address.
 * @param powerDomainId Power Domain Id, please refer to @ref spc_power_domain_id_t.
 */
static inline void SPC_ClearPowerDomainLowPowerRequestFlag(SPC_Type *base, spc_power_domain_id_t powerDomainId)
{
    base->PD_STATUS[(uint8_t)powerDomainId] |= SPC_PD_STATUS_PD_LP_REQ_MASK;
}

/*! @} */

/*!
 * @name Low Power Request configuration.
 * @{
 */
/*!
 * @brief Configs Low power request output pin.
 *
 * This function config the low power request output pin
 *
 * @param base SPC peripheral base address.
 * @param config Pointer the @ref spc_lowpower_request_config_t structure.
 */
void SPC_SetLowPowerRequestConfig(SPC_Type *base, const spc_lowpower_request_config_t *config);

/*! @} */

/*!
 * @name Smart Power Switch Control Interfaces
 * @{
 */

/*!
 * @brief Gates/Un-gates power switch in software mode.
 *
 * @param base SPC peripheral base address.
 * @param gate Used to gate/ungate power switch
 *          - \b true The power switch will be gated.
 *          - \b false The power switch will be un-gated.
 */
static inline void SPC_SoftwareGatePowerSwitch(SPC_Type *base, bool gate)
{
    if (gate)
    {
        base->CFG &= ~SPC_CFG_INTG_PWSWTCH_WKUP_ACTIVE_EN_MASK;
        base->CFG |= SPC_CFG_INTG_PWSWTCH_SLEEP_ACTIVE_EN_MASK;
    }
    else
    {
        base->CFG &= ~SPC_CFG_INTG_PWSWTCH_SLEEP_ACTIVE_EN_MASK;
        base->CFG |= SPC_CFG_INTG_PWSWTCH_WKUP_ACTIVE_EN_MASK;
    }
}

/*!
 * @brief Gates power switch at low power modes entry, and un-gates power switch at low power mode wakeup.
 *
 * @param base SPC peripheral base address.
 */
static inline void SPC_PowerModeControlPowerSwitch(SPC_Type *base)
{
    base->CFG &= ~(SPC_CFG_INTG_PWSWTCH_WKUP_ACTIVE_EN_MASK | SPC_CFG_INTG_PWSWTCH_SLEEP_ACTIVE_EN_MASK);
    base->CFG |= (SPC_CFG_INTG_PWSWTCH_SLEEP_EN_MASK | SPC_CFG_INTG_PWSWTCH_WKUP_EN_MASK);
}

/*! @} */

/*!
 * @name Wake up configuration.
 * @{
 */
/*!
 * @brief Set the address of the function/image to be executed if chip wake from power down or deep power down mode.
 *
 * @note Data written by this function is used by BootROM to quickly retore ARM Core context,
 * or to switch execution to a defined address in Flash/SRAM on WakeUp.
 *
 * @note The first word must be SP, and the second word must be PC.
 *
 * @note Please remember to calculate the CRC value of the first 48 bytes of image/function and save the result to
 * REGFILE1->REG[0]. The BootROM will check this CRC value, if authenticated successfully then the image/function
 * will be executed.
 *
 * @param base SPC peripheral base address.
 * @param data The address of the function/image to be executed if wakeup from low power mode.
 */
static inline void SPC_SetWakeUpValue(SPC_Type *base, uint32_t data)
{
    base->WAKEUP = data;
}

/*!
 * @brief Gets back the WakeUp value.
 *
 * @param base SPC peripheral base address.
 * @return The WakeUp value.
 */
static inline uint32_t SPC_GetWakeUpValue(SPC_Type *base)
{
    return base->WAKEUP;
}

/*! @} */

#if (defined(FSL_FEATURE_SPC_HAS_HP_CFG_REG) && FSL_FEATURE_SPC_HAS_HP_CFG_REG)
/*!
 * @name HP Mode configuration
 * @{
 */

/*!
 * @brief Check if HP_CFG selected as active configuration register.
 * 
 * @param base SPC peripheral base address.
 * 
 * @retval false ACTIVE_CFG selected as the active configuration register.
 * @retval true HP_CFG selected as the active configuration register. 
 */
static inline bool SPC_CheckHPCfgSelected(SPC_Type *base)
{
    return (bool)((base->SC & SPC_SC_HP_ACTIVE_MASK) != 0UL);
}

/*!
 * @brief Enable/disable high power request feature.
 * 
 * @param base SPC peripheral base address.
 * @param enable Used to specify enable/disable the high power request feature:
 *        - \b true Enable high power request;
 *        - \b false Disable high power reques.
 */
static inline void SPC_EnableHighPowerRequest(SPC_Type *base, bool enable)
{
    if (enable)
    {
        base->HP_CNFG_CTRL |= SPC_HP_CNFG_CTRL_HP_REQ_EN_MASK;
    }
    else
    {
        base->HP_CNFG_CTRL &= ~SPC_HP_CNFG_CTRL_HP_REQ_EN_MASK;
    }
}

/*!
 * @brief Override high power request manually.
 * 
 * @param base SPC peripheral base address.
 * @param opt Specify the option of high power override request, please refer to @ref spc_hp_override_request_option_t.
 */
static inline void SPC_OverrideHighPowerRequest(SPC_Type *base, spc_hp_override_request_option_t opt)
{
    base->HP_CNFG_CTRL = ((base->HP_CNFG_CTRL) & (~SPC_HP_CNFG_CTRL_OVERRIDE_OPT_MASK)) | SPC_HP_CNFG_CTRL_OVERRIDE_OPT(opt);
}

/*!
 * @brief Get voltage level of CORE LDO in high power mode.
 * 
 * @param base SPC peripheral base address.
 * @return The voltage level of CORE LDO in high power mode, please refer to @ref spc_core_ldo_voltage_level_t.
 */
static inline spc_core_ldo_voltage_level_t SPC_GetHighPowerModeCoreLDOVDDVoltageLevel(SPC_Type *base)
{
    return (spc_core_ldo_voltage_level_t)(uint32_t)((base->HP_CFG & SPC_HP_CFG_CORELDO_VDD_LVL_MASK) >> SPC_HP_CFG_CORELDO_VDD_LVL_SHIFT);
}

/*!
 * @brief Get bandgap mode in high power mode.
 * 
 * @param base SPC peripheral base address.
 * @return The bandgap mode in high power mode, please refer to @ref spc_bandgap_mode_t.
 */
static inline spc_bandgap_mode_t SPC_GetHighPowerModeBandgapMode(SPC_Type *base)
{
    return (spc_bandgap_mode_t)(uint32_t)((base->HP_CFG & SPC_HP_CFG_BGMODE_MASK) >> SPC_HP_CFG_BGMODE_SHIFT);
}

/*!
 * @brief Get enabled state of all voltage detectors.
 * 
 * @param base SPC peripheral base address.
 * @return All enabled status of all voltage detectors, 1b1 means the corrsponding voltage detector is enabled.
 */
static inline uint32_t SPC_GetHighPowerModeVoltageDetectStatus(SPC_Type *base)
{
    uint32_t state;

