martin8947/mcux_stage/mcxw_stage/drivers/fsl_spc.h
    state = base->HP_CFG & (SPC_HP_CFG_CORE_LVDE_MASK | SPC_HP_CFG_SYS_LVDE_MASK | SPC_HP_CFG_IO_LVDE_MASK |
            SPC_HP_CFG_CORE_HVDE_MASK | SPC_HP_CFG_SYS_HVDE_MASK | SPC_HP_CFG_IO_HVDE_MASK);

    return state;
}

/*!
 * @brief Set bandgap mode in high power mode.
 * 
 * @param base SPC peripheral base address.
 * @param mode Specify the bandgap mode in high power mode.
 *
 * @retval kStatus_SPC_BandgapModeWrong The Bandgap can not be disabled in high power mode.
 * @retval kStatus_Success Config Bandgap mode in high power mode successful.
 */
status_t SPC_SetHighPowerModeBandgapModeConfig(SPC_Type *base, spc_bandgap_mode_t mode);

/*!
 * @brief Enable/disable CMP buffer in high power mode.
 * 
 * @param base SPC peripheral base address.
 * @param enable Used to enable/disable CMP buffer:
 *       - \b true Enable CMP buffer in high power mode;
 *       - \b false Disable CMP buffer in high power mode.
 */
static inline void SPC_EnableHighPowerModeCMPBandgapBuffer(SPC_Type *base, bool enable)
{
    if (enable)
    {
        base->HP_CFG |= SPC_HP_CFG_LPBUFF_EN_MASK;
    }
    else
    {
        base->HP_CFG &= ~SPC_HP_CFG_LPBUFF_EN_MASK;
    }
}

/*!
 * @brief Disable/enable VDD Core Glitch detect feature in high power mode.
 * 
 * @param base SPC peripheral base address.
 * @param disable Used to disable/enable VDD Core Glitch detect feature:
 *          - \b true Disable VDD Core Glitch detect feature;
 *          - \b false Enable VDD Core Glitch detect feature.
 */
static inline void SPC_DisableHighPowerModeVddCoreGlitchDetect(SPC_Type *base, bool disable)
{
    if (disable)
    {
        base->HP_CFG |= SPC_HP_CFG_GLITCH_DETECT_DISABLE_MASK;
    }
    else
    {
        base->HP_CFG &= ~SPC_HP_CFG_GLITCH_DETECT_DISABLE_MASK;
    }
}

/*!
 * @brief Configure CORE LDO regulator in high power mode.
 * 
 * @param base SPC peripheral base address.
 * @param option Pointer to the CORE LDO regulator configuration, please refer to @ref spc_hp_mode_core_ldo_option_t.
 *
 * @retval #kStatus_Success Config Core LDO regulator in High power mode successful.
 * @retval #kStatus_SPC_Busy The SPC instance is busy to execute any type of power mode transition.
 * @retval #kStatus_SPC_CORELDOLowDriveStrengthIgnore If any voltage detect enabled, core_ldo's drive strength can not
 * set to low.
 * @retval #kStatus_SPC_CORELDOVoltageWrong The selected voltage level in high power mode is not allowed.
 * @retval #kStatus_Timeout Timeout occurs while waiting completion.
 */
status_t SPC_SetHighPowerModeCoreLDORegulatorConfig(SPC_Type *base,  spc_hp_mode_core_ldo_option_t *option);

/*!
 * @brief Configure System LDO regulator in high power mode.
 * 
 * @param base SPC peripheral base address.
 * @param option Pointer to the SYSTEM LDO regulator configuration, please refer to @ref spc_hp_mode_sys_ldo_option_t.
 *
 * @retval #kStatus_Success Config System LDO regulator in Active power mode successful.
 * @retval #kStatus_SPC_Busy The SPC instance is busy to execute any type of power mode transition.
 * @retval #kStatus_SPC_SYSLDOOverDriveVoltageFail Fail to regulator to Over Drive Voltage.
 * @retval #kStatus_SPC_SYSLDOLowDriveStrengthIgnore Set driver strength to Low will be ignored.
 * @retval #kStatus_Timeout Timeout occurs while waiting completion.
 */
status_t SPC_SetHighPowerModeSystemLDORegulatorConfig(SPC_Type *base, spc_hp_mode_sys_ldo_option_t *option);

/*!
 * @brief Configure DCDC regulator in high power mode.
 * 
 * @param base SPC peripheral base address.
 * @param option Pointer to the DCDC regulator configuration, please refer to @ref spc_hp_mode_dcdc_option_t.
 *
 * @retval #kStatus_Success Config DCDC regulator in Active power mode successful.
 * @retval #kStatus_SPC_Busy The SPC instance is busy to execute any type of power mode transition.
 * @retval #kStatus_SPC_DCDCLowDriveStrengthIgnore Set driver strength to Low will be ignored.
 * @retval #kStatus_Timeout Timeout occurs while waiting completion.
 */
status_t SPC_SetHighPowerModeDCDCRegulatorConfig(SPC_Type *base, spc_hp_mode_dcdc_option_t *option);

/*!
 * @brief Set configuration of regulators in high power mode.
 * 
 * @param base SPC peripheral base address.
 * @param config Pointer to the regulator configuration, please refer to @ref spc_hp_mode_regulators_config_t.
 *
 * @retval kStatus_Success Config regulators in High power mode successful.
 * @retval kStatus_SPC_BandgapModeWrong The bandgap mode setting in high power mode is wrong.
 * @retval kStatus_SPC_Busy The SPC instance is busy to execute any type of power mode transition.
 * @retval kStatus_SPC_CORELDOVoltageWrong The selected voltage level in high mode is not allowed.
 * @retval kStatus_SPC_SYSLDOOverDriveVoltageFail Fail to regulator to Over Drive Voltage.
 * @retval kStatus_SPC_SYSLDOLowDriveStrengthIgnore Set driver strength to Low will be ignored.
 * @retval kStatus_SPC_DCDCLowDriveStrengthIgnore Set driver strength to Low will be ignored.
 */
status_t SPC_SetHighPowerModeRegulatorsConfig(SPC_Type *base, spc_hp_mode_regulators_config_t *config);

/*!
 * @brief Enable/disable low voltage detect for VDD_CORE in high power mode.
 * 
 * @param base SPC peripheral base address.
 * @param enable Used to enable/disable low voltage detect feature for VDD_CORE in high power mode:
 *          - \b true Enable low voltage detect feature for VDD_CORE in high power mode;
 *          - \b false Disable low voltage detect feature for VDD_CORE in high power mode.
 */
static inline void SPC_EnableHighPowerModeCoreLowVoltageDetect(SPC_Type *base, bool enable)
{
    if (enable)
    {
        base->HP_CFG |= SPC_HP_CFG_CORE_LVDE_MASK;
    }
    else
    {
        base->HP_CFG &= ~SPC_HP_CFG_CORE_LVDE_MASK;
    }
}

/*!
 * @brief Enable/disable high voltage detect for VDD_CORE in high power mode.
 * 
 * @param base SPC peripheral base address.
 * @param enable Used to enable/disable high voltage detect feature for VDD_CORE in high power mode:
 *          - \b true Enable low voltage detect feature for VDD_CORE in high power mode;
 *          - \b false Disable low voltage detect feature for VDD_CORE in high power mode.
 */
static inline void SPC_EnableHighPowerModeCoreHighVoltageDetect(SPC_Type *base, bool enable)
{
    if (enable)
    {
        base->HP_CFG |= SPC_HP_CFG_CORE_HVDE_MASK;
    }
    else
    {
        base->HP_CFG &= ~SPC_HP_CFG_CORE_HVDE_MASK;
    }
}

/*!
 * @brief Enable/disable low voltage detect for VDD_SYS in high power mode.
 * 
 * @param base SPC peripheral base address.
 * @param enable Used to enable/disable low voltage detect feature for VDD_SYS in high power mode:
 *          - \b true Enable low voltage detect feature for VDD_SYS in high power mode;
 *          - \b false Disable low voltage detect feature for VDD_SYS in high power mode.
 */
static inline void SPC_EnableHighPowerModeSystemLowVoltageDetect(SPC_Type *base, bool enable)
{
    if (enable)
    {
        base->HP_CFG |= SPC_HP_CFG_SYS_LVDE_MASK;
    }
    else
    {
        base->HP_CFG &= ~SPC_HP_CFG_SYS_LVDE_MASK;
    }
}

/*!
 * @brief Enable/disable high voltage detect for VDD_SYS in high power mode.
 * 
 * @param base SPC peripheral base address.
 * @param enable Used to enable/disable high voltage detect feature for VDD_SYS in high power mode:
 *          - \b true Enable high voltage detect feature for VDD_SYS in high power mode;
 *          - \b false Disable high voltage detect feature for VDD_SYS in high power mode.
 */
static inline void SPC_EnableHighPowerModeSystemHighVoltageDetect(SPC_Type *base, bool enable)
{
    if (enable)
    {
        base->HP_CFG |= SPC_HP_CFG_SYS_HVDE_MASK;
    }
    else
    {
        base->HP_CFG &= ~SPC_HP_CFG_SYS_HVDE_MASK;
    }
}

/*!
 * @brief Enable/disable low voltage detect for VDD_IO_ABC in high power mode.
 * 
 * @param base SPC peripheral base address.
 * @param enable Used to enable/disable low voltage detect feature for VDD_IO_ABC in high power mode:
 *          - \b true Enable low voltage detect feature for VDD_IO_ABC in high power mode;
 *          - \b false Disable low voltage detect feature for VDD_IO_ABC in high power mode.
 */
static inline void SPC_EnableHighPowerModeIOLowVoltageDetect(SPC_Type *base, bool enable)
{
    if (enable)
    {
        base->HP_CFG |= SPC_HP_CFG_IO_LVDE_MASK;
    }
    else
    {
        base->HP_CFG &= ~SPC_HP_CFG_IO_LVDE_MASK;
    }
}

/*!
 * @brief Enable/disable high voltage detect for VDD_IO_ABC in high power mode.
 * 
 * @param base SPC peripheral base address.
 * @param enable Used to enable/disable high voltage detect feature for VDD_IO_ABC in high power mode:
 *          - \b true Enable high voltage detect feature for VDD_IO_ABC in high power mode;
 *          - \b false Disable high voltage detect feature for VDD_IO_ABC in high power mode.
 */
static inline void SPC_EnableHighPowerModeIOHighVoltageDetect(SPC_Type *base, bool enable)
{
    if (enable)
    {
        base->HP_CFG |= SPC_HP_CFG_IO_HVDE_MASK;
    }
    else
    {
        base->HP_CFG &= ~SPC_HP_CFG_IO_HVDE_MASK;
    }
}

/*! @} */
#endif /* (defined(FSL_FEATURE_SPC_HAS_HP_CFG_REG) && FSL_FEATURE_SPC_HAS_HP_CFG_REG) */

/*!
 * @name Active Mode configuration.
 * @{
 */

/*!
 * @brief Gets CORE LDO VDD Regulator Voltage level.
 *
 * This function returns the voltage level of CORE LDO Regulator in Active mode.
 *
 * @param base SPC peripheral base address.
 * @return Voltage level of CORE LDO in type of @ref spc_core_ldo_voltage_level_t enumeration.
 */
static inline spc_core_ldo_voltage_level_t SPC_GetActiveModeCoreLDOVDDVoltageLevel(SPC_Type *base)
{
    return (spc_core_ldo_voltage_level_t)(uint32_t)((base->ACTIVE_CFG & SPC_ACTIVE_CFG_CORELDO_VDD_LVL_MASK) >>
                                                    SPC_ACTIVE_CFG_CORELDO_VDD_LVL_SHIFT);
}

/*!
 * @brief Gets the Bandgap mode in Active mode.
 *
 * @param base SPC peripheral base address.
 * @return Bandgap mode in the type of @ref spc_bandgap_mode_t enumeration.
 */
static inline spc_bandgap_mode_t SPC_GetActiveModeBandgapMode(SPC_Type *base)
{
    return (spc_bandgap_mode_t)(uint32_t)((base->ACTIVE_CFG & SPC_ACTIVE_CFG_BGMODE_MASK) >>
                                          SPC_ACTIVE_CFG_BGMODE_SHIFT);
}

/*!
 * @brief Gets all voltage detectors status in Active mode.
 *
 * @param base SPC peripheral base address.
 * @return All voltage detectors status in Active mode.
 */
static inline uint32_t SPC_GetActiveModeVoltageDetectStatus(SPC_Type *base)
{
    uint32_t state;
    state = base->ACTIVE_CFG &
            (SPC_ACTIVE_CFG_IO_HVDE_MASK | SPC_ACTIVE_CFG_IO_LVDE_MASK | SPC_ACTIVE_CFG_SYS_HVDE_MASK |
             SPC_ACTIVE_CFG_SYS_LVDE_MASK | SPC_ACTIVE_CFG_CORE_HVDE_MASK | SPC_ACTIVE_CFG_CORE_LVDE_MASK);
    return state;
}

#if defined(FSL_FEATURE_SPC_HAS_CFG_REGISTER) && FSL_FEATURE_SPC_HAS_CFG_REGISTER
/*!
 * @brief Configs Integrated power switch in active mode.
 *
 * @note Legacy API and will be removed.
 *
 * @param base SPC peripheral base address.
 * @param config Pointer to spc_intergrated_power_switch_config_t pointer.
 */
void SPC_SetActiveModeIntegratedPowerSwitchConfig(SPC_Type *base, const spc_intergrated_power_switch_config_t *config);
#endif /* FSL_FEATURE_SPC_HAS_CFG_REGISTER */

/*!
 * @brief Configs Bandgap mode in Active mode.
 *
 * @note In active mode, beacause CORELDO_VDD_DS is reserved and set to Normal, so it is impossible to
 * disable Bandgap in active mode
 *
 * @param base SPC peripheral base address.
 * @param mode The Bandgap mode be selected.
 *
 * @retval #kStatus_SPC_BandgapModeWrong The Bandgap can not be disabled in active mode.
 * @retval #kStatus_Success Config Bandgap mode in Active power mode successful.
 */
status_t SPC_SetActiveModeBandgapModeConfig(SPC_Type *base, spc_bandgap_mode_t mode);

/*!
 * @brief Enables/Disable the CMP Bandgap Buffer in Active mode.
 *
 * @param base SPC peripheral base address.
 * @param enable Enable/Disable CMP Bandgap buffer.
 *          true    -   Enable Buffer Stored Reference voltage to CMP.
 *          false   -   Disable Buffer Stored Reference voltage to CMP.
 */
static inline void SPC_EnableActiveModeCMPBandgapBuffer(SPC_Type *base, bool enable)
{
    if (enable)
    {
        base->ACTIVE_CFG |= SPC_ACTIVE_CFG_LPBUFF_EN_MASK;
    }
    else
    {
        base->ACTIVE_CFG &= ~SPC_ACTIVE_CFG_LPBUFF_EN_MASK;
    }
}

/*!
 * @brief Sets the delay when the regulators change voltage level in Active mode.
 *
 * @param base SPC peripheral base address.
 * @param delay The number of SPC timer clock cycles.
 */
static inline void SPC_SetActiveModeVoltageTrimDelay(SPC_Type *base, uint16_t delay)
{
    base->ACTIVE_VDELAY = SPC_ACTIVE_VDELAY_ACTIVE_VDELAY(delay);
}

/*!
 * @brief Configs regulators in Active mode.
 *
 * This function provides the method to config all on-chip regulators in active mode.
 *
 * @param base SPC peripheral base address.
 * @param config Pointer to spc_active_mode_regulators_config_t structure.
 * @retval #kStatus_Success Config regulators in Active power mode successful.
 * @retval #kStatus_SPC_BandgapModeWrong The bandgap mode setting in Active mode is wrong.
 * @retval #kStatus_SPC_Busy The SPC instance is busy to execute any type of power mode transition.
 * @retval #kStatus_SPC_CORELDOVoltageWrong The selected voltage level in active mode is not allowed.
 * @retval #kStatus_SPC_SYSLDOOverDriveVoltageFail Fail to regulator to Over Drive Voltage.
 * @retval #kStatus_SPC_SYSLDOLowDriveStrengthIgnore Set driver strength to Low will be ignored.
 * @retval #kStatus_SPC_DCDCLowDriveStrengthIgnore Set driver strength to Low will be ignored.
 * @retval #kStatus_Timeout Timeout occurs while waiting completion.
 */
status_t SPC_SetActiveModeRegulatorsConfig(SPC_Type *base, const spc_active_mode_regulators_config_t *config);

/*!
 * @brief Disable/Enable VDD Core Glitch Detect in Active mode.
 *
 * @note State of glitch detect disable feature will be ignored if bandgap is disabled and
 * glitch detect hardware will be forced to OFF state.
 *
 * @param base SPC peripheral base address.
 * @param disable Used to disable/enable VDD Core Glitch detect feature.
 *         - \b true Disable VDD Core Low Voltage detect;
 *         - \b false Enable VDD Core Low Voltage detect.
 */
static inline void SPC_DisableActiveModeVddCoreGlitchDetect(SPC_Type *base, bool disable)
{
    if (disable)
    {
        base->ACTIVE_CFG |= SPC_ACTIVE_CFG_GLITCH_DETECT_DISABLE_MASK;
    }
    else
    {
        base->ACTIVE_CFG &= ~SPC_ACTIVE_CFG_GLITCH_DETECT_DISABLE_MASK;
    }
}

/*! @} */

/*!
 * @name Low Power mode configuration.
 * @{
 */

#if defined(FSL_FEATURE_SPC_HAS_CFG_REGISTER) && FSL_FEATURE_SPC_HAS_CFG_REGISTER
/*!
 * @brief Configs Integrated power switch in Low Power mode.
 *
 * @note Legacy API, will be removed.
 *
 * @param base SPC peripheral base address.
 * @param config Pointer to spc_intergrated_power_switch_config_t pointer.
 */
void SPC_SetLowPowerModeIntegratedPowerSwitchConfig(SPC_Type *base,
                                                    const spc_intergrated_power_switch_config_t *config);
#endif /* FSL_FEATURE_SPC_HAS_CFG_REGISTER */

#if defined(FSL_FEATURE_SPC_HAS_WBIAS_EN) && FSL_FEATURE_SPC_HAS_WBIAS_EN
/*!
 * @brief Enables/Disables VDDC Well Bias in low power mode.
 *
 * @param base SPC peripheral base address.
 * @param enable Enable/Disable the VDDC Well Bias.
 *          true    -   Enable Vddc Well Bias.
 *          false   -   Disable Vddc Well Bias.
 */
static inline void SPC_EnableLowPowerModeVDDCWellBias(SPC_Type *base, bool enable)
{
    if (enable)
    {
        base->LP_CFG |= SPC_LP_CFG_WBIAS_EN_MASK;
    }
    else
    {
        base->LP_CFG &= ~SPC_LP_CFG_WBIAS_EN_MASK;
    }
}
#endif /* FSL_FEATURE_SPC_HAS_WBIAS_EN */

/*!
 * @brief Gets CORE LDO VDD Drive Strength for Low Power modes.
 *
 * @param base SPC peripheral base address.
 * @return The CORE LDO's VDD Drive Strength.
 */
static inline spc_core_ldo_drive_strength_t SPC_GetLowPowerCoreLDOVDDDriveStrength(SPC_Type *base)
{
    return (spc_core_ldo_drive_strength_t)(uint32_t)((base->LP_CFG & SPC_LP_CFG_CORELDO_VDD_DS_MASK) >>
                                                     SPC_LP_CFG_CORELDO_VDD_DS_SHIFT);
}

/*!
 * @brief Gets the CORE LDO VDD Regulator Voltage Level for Low Power modes.
 *
 * @param base SPC peripheral base address.
 * @return The CORE LDO VDD Regulator's voltage level.
 */
static inline spc_core_ldo_voltage_level_t SPC_GetLowPowerCoreLDOVDDVoltageLevel(SPC_Type *base)
{
    return ((spc_core_ldo_voltage_level_t)(uint32_t)((base->LP_CFG & SPC_LP_CFG_CORELDO_VDD_LVL_MASK) >>
                                                     SPC_LP_CFG_CORELDO_VDD_LVL_SHIFT));
}

/*!
 * @brief Gets the Bandgap mode in Low Power mode.
 *
 * @param base SPC peripheral base address.
 * @return Bandgap mode in the type of @ref spc_bandgap_mode_t enumeration.
 */
static inline spc_bandgap_mode_t SPC_GetLowPowerModeBandgapMode(SPC_Type *base)
{
    return (spc_bandgap_mode_t)(uint32_t)((base->LP_CFG & SPC_LP_CFG_BGMODE_MASK) >> SPC_LP_CFG_BGMODE_SHIFT);
}

/*!
 * @brief Gets the status of all voltage detectors in Low Power mode.
 *
 * @param base SPC peripheral base address.
 * @return The status of all voltage detectors in low power mode.
 */
static inline uint32_t SPC_GetLowPowerModeVoltageDetectStatus(SPC_Type *base)
{
    uint32_t state;
    state = base->LP_CFG & (SPC_LP_CFG_IO_HVDE_MASK | SPC_LP_CFG_IO_LVDE_MASK | SPC_LP_CFG_SYS_HVDE_MASK |
                            SPC_LP_CFG_SYS_LVDE_MASK | SPC_LP_CFG_CORE_HVDE_MASK | SPC_LP_CFG_CORE_LVDE_MASK);
    return state;
}

/*!
 * @brief Enables/Disables Low Power IREF in low power modes.
 *
 * This function enables/disables Low Power IREF. Low Power IREF can only get
 * disabled in Deep power down mode. In other low power modes, the Low Power IREF
 * is always enabled.
 *
 * @param base SPC peripheral base address.
 * @param enable Enable/Disable Low Power IREF.
 *          true    -   Enable Low Power IREF for Low Power modes.
 *          false   -   Disable Low Power IREF for Deep Power Down mode.
 */
static inline void SPC_EnableLowPowerModeLowPowerIREF(SPC_Type *base, bool enable)
{
    if (enable)
    {
        base->LP_CFG |= SPC_LP_CFG_LP_IREFEN_MASK;
    }
    else
    {
        base->LP_CFG &= ~SPC_LP_CFG_LP_IREFEN_MASK;
    }
}

/*!
 * @brief Configs Bandgap mode in Low Power mode.
 *
 * This function configs Bandgap mode in Low Power mode.
 * IF user want to disable Bandgap while keeping any of the Regulator in Normal Driver Strength
 * or if any of the High voltage detectors/Low voltage detectors are kept enabled, the Bandgap mode
 * will be set as Bandgap Enabled with Buffer Disabled.
 *
 * @note This API shall be invoked following set HVDs/LVDs and regulators' driver strength.
 *
 * @param base SPC peripheral base address.
 * @param mode The Bandgap mode be selected.
 * @retval #kStatus_SPC_BandgapModeWrong The bandgap mode setting in Low Power mode is wrong.
 * @retval #kStatus_Success Config Bandgap mode in Low Power power mode successful.
 */
status_t SPC_SetLowPowerModeBandgapmodeConfig(SPC_Type *base, spc_bandgap_mode_t mode);

/*!
 * @brief Enables/Disables CMP Bandgap Buffer.
 *
 * This function gates CMP bandgap buffer. CMP bandgap buffer is automatically disabled and turned off
 * in Deep Power Down mode.
 *
 * @param base SPC peripheral base address.
 * @param enable Enable/Disable CMP Bandgap buffer.
 *          true    -   Enable Buffer Stored Reference Voltage to CMP.
 *          false   -   Disable Buffer Stored Reference Voltage to CMP.
 */
static inline void SPC_EnableLowPowerModeCMPBandgapBufferMode(SPC_Type *base, bool enable)
{
    if (enable)
    {
        base->LP_CFG |= SPC_LP_CFG_LPBUFF_EN_MASK;
    }
    else
    {
        base->LP_CFG &= ~SPC_LP_CFG_LPBUFF_EN_MASK;
    }
}

/*!
 * @brief Enables/Disables CORE VDD IVS(Internal Voltage Scaling) in low power modes.
 *
 * This function gates CORE VDD IVS. When enabled, the IVS regulator will scale the
 * external input CORE VDD to a lower voltage level to reduce internal leakage.
 * IVS is invalid in Sleep or Deep power down mode.
 *
 * @param base SPC peripheral base address.
 * @param enable Enable/Disable IVS.
 *          true    -   enable CORE VDD IVS in Deep Sleep mode or Power Down mode.
 *          false   -   disable CORE VDD IVS in Deep Sleep mode or Power Down mode.
 */
static inline void SPC_EnableLowPowerModeCoreVDDInternalVoltageScaling(SPC_Type *base, bool enable)
{
    if (enable)
    {
        base->LP_CFG |= SPC_LP_CFG_COREVDD_IVS_EN_MASK;
    }
    else
    {
        base->LP_CFG &= ~SPC_LP_CFG_COREVDD_IVS_EN_MASK;
    }
}

/*!
 * @brief Sets the delay when exit the low power modes.
 *
 * @param base SPC peripheral base address.
 * @param delay The number of SPC timer clock cycles that the SPC waits on exit from low power modes.
 */
static inline void SPC_SetLowPowerWakeUpDelay(SPC_Type *base, uint16_t delay)
{
    base->LPWKUP_DELAY = SPC_LPWKUP_DELAY_LPWKUP_DELAY(delay);
}

/*!
 * @brief Configs regulators in Low Power mode.
 *
 * This function provides the method to config all on-chip regulators in Low Power mode.
 *
 * @param base SPC peripheral base address.
 * @param config Pointer to spc_lowpower_mode_regulators_config_t structure.
 * @retval #kStatus_Success Config regulators in Low power mode successful.
 * @retval #kStatus_SPC_BandgapModeWrong The bandgap mode setting in Low Power mode is wrong.
 * @retval #kStatus_SPC_Busy The SPC instance is busy to execute any type of power mode transition.
 * @retval #kStatus_SPC_CORELDOVoltageWrong The selected voltage level is wrong.
 * @retval #kStatus_SPC_CORELDOLowDriveStrengthIgnore Set driver strength to low will be ignored.
 * @retval #kStatus_SPC_CORELDOVoltageSetFail. Fail to change Core LDO voltage level.
 * @retval #kStatus_SPC_SYSLDOLowDriveStrengthIgnore Set driver strength to low will be ignored.
 * @retval #kStatus_SPC_DCDCPulseRefreshModeIgnore Set driver strength to Pulse Refresh mode will be ignored.
 * @retval #kStatus_SPC_DCDCLowDriveStrengthIgnore Set driver strength to Low Drive Strength will be ignored.
 */
status_t SPC_SetLowPowerModeRegulatorsConfig(SPC_Type *base, const spc_lowpower_mode_regulators_config_t *config);

/*!
 * @brief Disable/Enable VDD Core Glitch Detect in low power mode.
 *
 * @note State of glitch detect disable feature will be ignored if bandgap is disabled and
 * glitch detect hardware will be forced to OFF state.
 *
 * @param base SPC peripheral base address.
 * @param disable Used to disable/enable VDD Core Glitch detect feature.
 *         - \b true Disable VDD Core Low Voltage detect;
 *         - \b false Enable VDD Core Low Voltage detect.
 */
static inline void SPC_DisableLowPowerModeVddCoreGlitchDetect(SPC_Type *base, bool disable)
{
    if (disable)
    {
        base->LP_CFG |= SPC_LP_CFG_GLITCH_DETECT_DISABLE_MASK;
    }
    else
    {
        base->LP_CFG &= ~SPC_LP_CFG_GLITCH_DETECT_DISABLE_MASK;
    }
}

/*! @} */

